Catalogs/ИсходящаяКорреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИсходящаяКорреспонденция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗакреплен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесРПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрикрепленныйФайл</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИсходящаяКорреспонденция/Ext/ManagerModule.bsl
Функция СоздатьЭлементПоШаблонуПечатнойФормы(Шаблон) Экспорт

	Если ТипЗнч(Шаблон) <> Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
	
		ВызватьИсключение
			"Передан не правильный тип" + Символы.ПС
			+ "Тип параметра переданного в функцию: " + ТипЗнч(Шаблон);
	
	КонецЕсли;
	
	Если Шаблон.Пустая() Тогда
	
		ВызватьИсключение "Не заполнен шаблон";
	
	КонецЕсли;
	
	Если Шаблон.ТипПисьма.Пустая() Тогда
	
		ВызватьИсключение "Не заполнен тип письма";
	
	КонецЕсли;
	
	НовыйОбъект = СоздатьЭлемент();
	
	ЗаполнитьБазовыеПараметры(НовыйОбъект);
	НовыйОбъект.Подписант = ПолучитьПолписанта(НовыйОбъект);
	
	ЗаполнитьОписаниеПисьма(НовыйОбъект, Шаблон.ТипПисьма, Шаблон.ТемаПисьма);

	Возврат НовыйОбъект;

КонецФункции // ()

Процедура ЗаполнитьБазовыеПараметры(ОбъектВх)

	ОбъектВх.Автор = Пользователи.ТекущийПользователь();
	ОбъектВх.Организация = ОбъектВх.Автор.Организация;

КонецПроцедуры

Функция ПолучитьПолписанта(ОбъектВх)

	Возврат ОбъектВх.Автор;

КонецФункции // ()

Функция ЗаполнитьОписаниеПисьма(ОбъектВх, ТипПисьма, ТемаПисьма)

	ОбъектВх.ТипПисьма = ТипПисьма;
	ОбъектВх.Наименование = ТемаПисьма;  
	
	НастойкаПараметровПисем = бит_ИнтеграцияПочтаРФ.ВернутьПараметрыПисем(ОбъектВх.ТипПисьма);
	бит_ИнтеграцияПочтаРФ.ЗаполнитьПараметрыИсходящейКорреспонденции(ОбъектВх, НастойкаПараметровПисем);

КонецФункции // ()
